tests/form-app/load.yml
config:
  environments:
    dev:
      target: 'https://form.adsp-dev.gov.ab.ca'
    uat:
      target: 'https://form.adsp-uat.alberta.ca' # The target will not be overwrote in the configuration.
  ensure:
    thresholds:
      - 'http.response_time.p99': 500
      - 'http.response_time.p95': 300
  payload:
    - path: '../artillery.{{ $environment }}.csv'
      skipHeader: true
      fields:
        - 'keycloak_url'
        - 'realm_id'
        - 'tenant_name'
        - 'client_id'
    - path: './application.{{ $environment }}.csv'
      skipHeader: true
      fields:
        - 'form-name'
  phases:
    - duration: 10
      arrivalRate: 5
      rampTo: 5
      name: Warm up phase
    - duration: '10m'
      arrivalCount: 360
      name: Soak test phase
before:
  flow:
    - log: 'Getting the access token (tenant: {{ realm_id }})'
    - post:
        url: '{{ keycloak_url }}/auth/realms/{{ realm_id }}/protocol/openid-connect/token'
        headers:
          Content-Type: 'application/x-www-form-urlencoded'
          Accept: 'application/json'
        form:
          {
            grant_type: 'client_credentials',
            client_id: '{{ $processEnvironment.ARTILLERY_CLIENT_SECRET }}',
            client_secret: '{{ $processEnvironment.ARTILLERY_CLIENT_SECRET }}',
          }
        capture:
          - json: '$.access_token'
            as: token
scenarios:
  - name: 'User visit small size form'
    weight: 10
    flow:
      - get:
          url: '/{{ form-name }}/{{ form-name }}'
      - think: '{{ $randomNumber(15,20) }}' # stop for 20 seconds