tests/form-app/load.yml
config:
  # The target will not be overwrote in the configuration.
  target: 'https://form-service.adsp-dev.gov.ab.ca'
  ensure:
    thresholds:
      - 'http.response_time.p99': 500
      - 'http.response_time.p95': 300
  payload:
    - path: './artillery.{{  $processEnvironment.ARTILLERY_ENV }}.csv'
      skipHeader: true
      fields:
        - 'keycloak_url'
        - 'realm_id'
        - 'form-service-host'
        - 'form-app-host'
  phases:
    - duration: 10
      arrivalRate: 5
      rampTo: 5
      name: Warm up phase
    - duration: '10m'
      arrivalCount: 360
      name: Soak test phase
before:
  flow:
    - log: 'Getting the access token (tenant: {{ realm_id }})'
    - post:
        url: '{{ keycloak_url }}/auth/realms/{{ realm_id }}/protocol/openid-connect/token'
        headers:
          Content-Type: 'application/x-www-form-urlencoded'
          Accept: 'application/json'
        form:
          {
            grant_type: 'client_credentials',
            client_id: '{{ $processEnvironment.CLIENT_ID }}',
            client_secret: '{{ $processEnvironment.CLIENT_SECRET }}',
          }
        capture:
          - json: '$.access_token'
            as: token
scenarios:
  - name: 'User visit small size form'
    weight: 25
    flow:
      - get:
          url: '{{ form-app-host }}/autotest/load-test-s-v1-pub'
      - think: '{{ $randomNumber(15,20) }}' # stop for 20 seconds
      - post:
          url: '{{ form-service-host }}/form/v1/forms'
          headers:
            authorization: 'Bearer {{ token }}'
          json:
            definitionId: load-test-s-v1
            data:
              name: mock-test-name
            submit: false